from cl_Question import Question

var0 = [
    "Какое из этих слов не имеет ничего общего с медициной?\n(a)атеросклероз\n(b)перфоратор\n(c)тремор\n(d)асфиксия\n\n",
    "Кто пациенты у неонатолога?\n(a)новорожденные\n(b)спортсмены\n(c)кошки\n(d)космонавты\n\n",
    "Какие мужчины - страх погонофобов?\n(a)Рыжие\n(b)Бородатые\n(c)Лысые\n(d)Усатые\n\n",
    "Какой витамин также называют аскорбиновая кислота?\n(a)B\n(b)C\n(c)D\n(d)A\n\n",
    "Чем можно заболеть после укуса мухи цеце?\n(a)Энцефалит\n(b)Желтая лихорадка\n(c)Болезнь легионеров\n(d)Сонная болезнь\n\n",
    "А после укуса комара?\n(a)Свинка\n(b)Малярия\n(c)Ветрянка\n(d)Корь\n\n",
    "Как в народе называют стенокардию?\n(a)Сердечная змея\n(b)Грудная жаба\n(c)Желудочная саламандра\n(d)Легочная ящерица\n\n",
    "Что проверяет врач, ударяя молоточком по колену?\n(a)Трезвость\n(b)Терпение\n(c)!Рефлексы\n(d)Равновесие\n\n",
    "Какой регион Земли известен своей нетрадиционной медициной?\n(a)Тибет\n(b)Анды\n(c)Памир\n(d)Альпы\n\n",
    "Какое заболевание врачи еще не научились лечить?\n(a)Сенную лиxорадку\n(b)Золотую лиxорадку\n(c)Желтую лиxорадку\n(d)Москитную лиxорадку\n\n"
]

questions_list0 = [
    Question(var0[0], 'b'),
    Question(var0[1], 'a'),
    Question(var0[2], 'b'),
    Question(var0[3], 'b'),
    Question(var0[4], 'd'),
    Question(var0[5], 'b'),
    Question(var0[6], 'b'),
    Question(var0[7], 'c'),
    Question(var0[8], 'a'),
    Question(var0[9], 'a')
]

var1 = [
    "В чём заключается функция фитонцидов?\n(a)придание фруктам вяжущего вкуса\n(b)окраска плодов в оранжевый цвет\n(c)уничтожение микроорганизмов за счёт наличия бактерицидных свойств\n(d)придание овощным культурам острого вкуса\n\n",
    "Какая кислота образуется в процессе квашения?\n(a)уксусная\n(b)молочная\n(c)лимонная\n(d)яблочная\n\n",
    "Назовите основные пищевые вещества.\n(a)белки, полезные микроэлементы, жидкость, витамины\n(b)белки, жиры, углеводы\n(c)полезные микроэлементы, жидкость, витамины\n(d)витамины, полезные микроэлементы\n\n",
    "Какой из перечисленных продуктов является источником полноценного белка?\n(a)макароны\n(b)подсолнечное масло\n(c)малина\n(d)молоко\n\n",
    "Назовите основную функцию углеводов.\n(a)создание биологически важных соединений\n(b)обеспечение организма энергией\n(c)восполнение дефицита витаминов\n(d)улучшение кислородного обмена\n\n",
    "Назовите полезную функцию продукта -рыбий жир?\n(a)повышение уровня холестерина в крови\n(b)снижение уровня холестерина в крови\n(c)улучшение сопротивляемости иммунной системы\n(d)очищение и улучшение циркуляции крови\n\n",
    "Назовите продукт с высоким содержанием фосфора.\n(a)халва\n(b)ирга\n(c)сыр\n(d)крыжовник\n\n",
    "Что такое пищеварение?\n(a)получение и использование полезных микроэлементов, полученных из пищи\n(b)ферментное расщепление крупных органических соединений на более мелкие\n(c)химическое расщепление органических соединений на ряд неорганических\n(d)механическое раздробление пищи на мелкие фрагменты\n\n",
    "Что не способствует правильной усвояемости пищи?\n(a)ярко выраженный аромат\n(b)отсуствие режима питания\n(c)кулинарная обработка\n(d)вкусовые свойства\n\n",
    "Назовите процессы, на которые расходуется энергия основного обмена.\n(a)дыхание и теплообмен\n(b)физическая нагрузка\n(c)функционирование внутренних органов, теплообмен, физическая нагрузка\n(d)теплообмен и функционирование внутренних органов\n\n"
]

questions_list1 = [
    Question(var1[0], 'c'),
    Question(var1[1], 'b'),
    Question(var1[2], 'b'),
    Question(var1[3], 'd'),
    Question(var1[4], 'b'),
    Question(var1[5], 'b'),
    Question(var1[6], 'c'),
    Question(var1[7], 'b'),
    Question(var1[8], 'b'),
    Question(var1[9], 'd')
]


var2 = [
    "Древнейшей формой организации физической культуры были?\n(a)бега\n(b)единоборство\n(c)соревнования на колесницах\n(d)игры\n\n",
    "Физическая культура рабовладельческого общества имела?\n(a)прикладную направленность\n(b)военную и оздоровительную направленность\n(c)образовательную направленность\n(d)воспитательную направленность\n\n",
    "Российский Олимпийский Комитет был создан в\n(a)1908 году\n(b)1911 году\n(c)1912 году\n(d)1916 году\n\n",
    "Александр Попов – Чемпион Олимпийских игр в\n(a)плавание\n(b)легкая атлетика\n(c)лыжные гонки\n(d)велоспорт\n\n",
    "Какой из перечисленных видов не входит в программу современного пятиборья\n(a)стрельба\n(b)фехтование\n(c)гимнастика\n(d)верховая езда\n\n",
    "Кто был первым президентом Международного олимпийского комитета?\n(a)Пьер де Кубертен\n(b)Алексей Бутовский\n(c)Майкл Килланин\n(d)Деметриус Викелас\n\n",
    "В каком году был образован Международный олимпийский комитет?\n(a)1890\n(b)1894\n(c)1892\n(d)1896\n\n",
    "В каком году Олимпийские игры состоялись в нашей стране?\n(a)планировались в 1944 году, но были отменены из-за 2 мировой войны\n(b)в 1976 году в Сочи\n(c)в 1980 году в Москве\n(d)пока еще не проводились\n\n",
    "Временное снижение работоспособности принято называть:\n(a)усталостью\n(b)напряжением\n(c)утомлением\n(d)передозировкой\n\n",
    "Какое физическое качество развивается при длительном беге в медленном темпе?\n(a)сила\n(b)выносливость\n(c)быстрота\n(d)ловкость\n\n"
]
questions_list2 = [
    Question(var2[0], 'd'),
    Question(var2[1], 'b'),
    Question(var2[2], 'b'),
    Question(var2[3], 'a'),
    Question(var2[4], 'c'),
    Question(var2[5], 'd'),
    Question(var2[6], 'b'),
    Question(var2[7], 'c'),
    Question(var2[8], 'c'),
    Question(var2[9], 'b')
]


var3 = [
    "Кто из ученых сформулировал закон гомологичных рядов наследственности и изменчивости:\n(a)Ч.Дарвин\n(b)С.С. Четвериков\n(c)Н.И.Вавилов\n(d)И.М.Сеченов\n\n",
    "Результатом эволюции является:\n(a)Наследственная изменчивость\n(b)Борьба за существование\n(c)Многообразие видов\n(d)Ароморфоз\n\n",
    "В каком году был предложен термин «клетка»?\n(a)1675 году\n(b)1665 году\n(c)1681 году\n(d)1674 году\n\n",
    "Основатель учения о происхождении видов путем естественного отбора:\n(a)Ч.Дарвин\n(b)Ж-Б.Ламарк\n(c)К.Линней\n(d)М.Ломоносов\n\n",
    "Количество хромосом у человека?\n(a)28\n(b)38\n(c)23\n(d)46\n\n",
    "Заключительной фазой в митозе является:\n(a)Телофаза\n(b)Анафаза\n(c)Метафаза\n(d)Профаза\n\n",
    "Набор половых хромосом у мужчин:\n(a)XX\n(b)YY\n(c)XY\n(d)XO\n\n",
    "Тип деления клеток, в результате которого образуется половые клетки:\n(a)Амитоз\n(b)Мейоз\n(c)Митоз\n(d)Биоценоз\n\n",
    "Кто первым открыл клетку?\n(a)Р.Гук\n(b)А.Левенгук\n(c)Р.Броун\n(d)Т.Шванн\n\n",
    "Совокупность всех генов гаплоидного набора хромосом – это:\n(a)Генотип\n(b)Геном\n(c)Генофонд\n(d)Фенотип\n\n"
]
questions_list3 = [
    Question(var3[0], 'c'),
    Question(var3[1], 'c'),
    Question(var3[2], 'b'),
    Question(var3[3], 'a'),
    Question(var3[4], 'd'),
    Question(var3[5], 'c'),
    Question(var3[6], 'c'),
    Question(var3[7], 'b'),
    Question(var3[8], 'a'),
    Question(var3[9], 'b')
]


var4 = [
    "В каких единицах измеряют азимут?\n(a)В сантиметрах\n(b)В градусах\n(c)В минутах\n(d)В часах\n\n",
    "Куда направлена намагниченная стрелка компаса?\n(a)На запад\n(b)На юг\n(c)На север\n(d)На восток\n\n",
    "Какая часть света будет слева, если встать лицом к северу?\n(a)Запад\n(b)Восток\n(c)Юг\n(d)Нельзя сказать однозначно, всё будет зависеть от местности\n\n",
    "Какому значению соответствует азимут на восток?\n(a)0\n(b)90\n(c)180\n(d)270\n\n",
    "Азимут на запад равен\n(a)0\n(b)90\n(c)180\n(d)270\n\n",
    "Азимут отсчитывают согласно этому правилу -\n(a)По ходу часовой стрелки от направления на юг\n(b)Против хода часовой стрелки от направления на юг\n(c)По ходу часовой стрелки от направления на север\n(d)Против хода часовой стрелки от направления на север\n\n",
    "На какие части экватор делит Землю?\n(a)На нижнюю и верхнюю часть\n(b)На Восточное и Западное полушария\n(c)На четверти разных сторон света\n(d)На Северное и Южное полушария\n\n",
    " Правильно закончите утверждение: меридианы – линии направления\n(a)Запад-восток\n(b)Север-юг\n(c)Юг-восток\n(d)Север-запад\n\n",
    "Что является нулевой параллелью?\n(a)Земная ось\n(b)Экватор\n(c)Гринвичская параллель\n(d)Диагональ Земли\n\n",
    "Какой меридиан является нулевым?\n(a)Земная ось\n(b)Экватор\n(c)Гринвичский меридиан\n(d)Диагональ Земли\n\n"
]
questions_list4 = [
    Question(var4[0], 'b'),
    Question(var4[1], 'c'),
    Question(var4[2], 'a'),
    Question(var4[3], 'b'),
    Question(var4[4], 'd'),
    Question(var4[5], 'c'),
    Question(var4[6], 'd'),
    Question(var4[7], 'b'),
    Question(var4[8], 'b'),
    Question(var4[9], 'c')
]


var5 = [
    "Признаками алкогольного отравления являются:\n(a)рвота, судороги, неритмичное дыхание, бледность\n(b)повышенный ритм работы сердца, тошнота\n(c)высокое давление\n(d)низкое давление\n\n",
    "Что относится к вредным привычкам?\n(a)здоровый образ жизни\n(b)правильное питание\n(c)употребление алкоголя\n(d)занятие спортом\n\n",
    "В каком веществе присутствует содержание табачного дыма?\n(a)никотин\n(b)кислород\n(c)азот\n(d)водород\n\n",
    "К каким заболеваниям приводят наркотики\n(a)инфаркт\n(b)инсульт\n(c)онкологические заболевания\n(d)СПИД\n\n",
    "К каким заболеваниям приводит курение?\n(a)рак легких\n(b)вегетососудистая дистония\n(c)анемия\n(d)СПИД\n\n",
    "Что является профилактикой вредных привычек?\n(a)соблюдать личную гигиену\n(b)не пробовать алкоголь, табак\n(c)спорт\n(d)здоровый образ жизни\n\n",
    "Что характерно для человека в состоянии алкогольного опьянения?\n(a)ясность восприятия окружения\n(b)доброта\n(c)нарушение равновесия\n(d)всевозможные достижения\n\n",
    "Для кого больше всего опасен алкоголь:\n(a)для пожилых людей\n(b)для молодых девушек\n(c)для подростков\n(d)алкоголь одинаково оказывает на всех негативное действие\n\n",
    "Какое действие алкоголь оказывает на организм человека?\n(a)повышает иммунитет\n(b)увеличивает выносливость организма\n(c)парализует клетки головного мозга\n(d)чистит сосуды\n\n",
    "Каким органам курение наносит вред?\n(a)почки\n(b)печень\n(c)мозг\n(d)употребление табака негативно влияет на все органы\n\n"
]
questions_list5 = [
    Question(var5[0], 'a'),
    Question(var5[1], 'c'),
    Question(var5[2], 'a'),
    Question(var5[3], 'd'),
    Question(var5[4], 'a'),
    Question(var5[5], 'b'),
    Question(var5[6], 'c'),
    Question(var5[7], 'd'),
    Question(var5[8], 'c'),
    Question(var5[9], 'd')
]


var6 = [
    "Кто управляет куклами с помощью нитей?\n(a)кукловод\n(b)кукловед\n(c)повелитель кукол\n(d)куклолюб\n\n",
    "Какую конструкцию имеют жилища кочевых народов?\n(a)подборную\n(b)отборную\n(c)разборную\n(d)переборную\n\n",
    "С помощью какого инструмента завинчивается винт?\n(a)отвертка\n(b)гаечный ключ\n(c)стамеска\n(d)ножовка\n\n",
    "Что не входит в состав компьютера?\n(a)монитор\n(b)клавиатура\n(c)мышь\n(d)пульт\n\n",
    "К печатным устройствам относится\n(a)термос\n(b)телевизор\n(c)принтер\n(d)микрофон\n\n",
    "Что такое квиллинг?\n(a)искусство бумагокручения\n(b)искусство бисероплетения\n(c)гончарное искусство\n(d)мозаичное искусство\n\n",
    "Какая деталь имеет шестигранную головку?\n(a)болт\n(b)гайка\n(c)винт\n(d)гвоздь\n\n",
    "Какой вид ткани относится к эластичным?\n(a)интерлок\n(b)хлопок\n(c)байка\n(d)плательная ткань\n\n",
    "Какая ткань относится к несыпучим?\n(a)органза\n(b)флис\n(c)шелк\n(d)шерсть\n\n",
    "Какая передача помогает вращаться колесам швейной машинки?\n(a)телевизионная\n(b)ременная\n(c)нижняя\n(d)голевая\n\n"
]
questions_list6 = [
    Question(var6[0], 'a'),
    Question(var6[1], 'c'),
    Question(var6[2], 'a'),
    Question(var6[3], 'd'),
    Question(var6[4], 'c'),
    Question(var6[5], 'a'),
    Question(var6[6], 'a'),
    Question(var6[7], 'b'),
    Question(var6[8], 'b'),
    Question(var6[9], 'b')
]


var7 = [
    "Что образует опорно-двигательную систему?\n(a)мышцы, пояс верхних конечностей\n(b)скелет, хрящи, связки\n(c)мышцы и кости (скелет) тела\n(d)все ответы верны\n\n",
    "Полость, находящаяся между головками трубчатых костей, называется:\n(a)трубчатая полость\n(b)мозговое пространство\n(c)костно-трубчатое пространство\n(d)костномозговая полость\n\n",
    "В скелете головы человека выделяют два отдела\n(a)мозговой, лицевой\n(b)мозговой, теменной\n(c)лицевой, затылочный\n(d)верных ответов нет\n\n",
    "Основой туловища скелета является:\n(a)позвоночник\n(b)тазовый пояс\n(c)плечевой пояс\n(d)череп\n\n",
    "Чем образован скелет нижних конечностей?\n(a)таз, бедро, стопа\n(b)бедро, колено, голень\n(c)бедро, голень, стопа\n(d)таз, бедро, голень\n\n",
    "Какими костями образован тазовый пояс человека?\n(a)две тазовые кости\n(b)одна тазовая кость\n(c)крестец\n(d)две тазовые кости, бедренные суставы\n\n",
    "Чем представлен желтый костный мозг?\n(a)в основном жировой тканью\n(b)в основном костной тканью\n(c)в основном соединительной тканью\n(d)в основном хрящевой тканью и остеоцитами\n\n",
    "Укажите функции суставной жидкости:\n(a)питание суставного хряща\n(b)уменьшение трения костей при движении\n(c)обеспечивает рост надкостницы\n(d)верны ответы a,b\n\n",
    "Где дано верное определение понятию сустав:\n(a)подвижные соединения костей\n(b)полуподвижные соединения костей\n(c)активная конструкция мышц и костей\n(d)ротационное соединение позвонков\n\n",
    "Функции суставной жидкости:\n(a)питание суставного хряща\n(b)уменьшение трения костей при движении\n(c)обеспечивает рост надкостницы\n(d)верны ответы a,b\n\n"
]
questions_list7 = [
    Question(var7[0], 'c'),
    Question(var7[1], 'd'),
    Question(var7[2], 'a'),
    Question(var7[3], 'a'),
    Question(var7[4], 'c'),
    Question(var7[5], 'a'),
    Question(var7[6], 'a'),
    Question(var7[7], 'd'),
    Question(var7[8], 'a'),
    Question(var7[9], 'd')
]


var8 = [
    "Металлические характеристики в ряду K → Nа → Mg → Al\n(a)снижаются\n(b)усиливаются\n(c)никак не изменяются\n(d)сначала усиливаются, затем снижаются\n\n",
    "Чему равно число энергетических уровней в атоме фосфора (Р)?\n(a)6\n(b)14\n(c)3\n(d)26\n\n",
    "Выберите соединение с ионной связью\n(a)BaO\n(b)CCl4\n(c)Mg\n(d)H2S\n\n",
    "Какое максимальное количество электронов может находиться на р-орбиталях?\n(a)4\n(b)8\n(c)6\n(d)3\n\n",
    "Между атомами какого вещества в молекуле образуется ковалентная полярная связь?\n(a)NaCl\n(b)NH3\n(c)MgCl2\n(d)ZnO\n\n",
    "Молекуле какого вещества характерна ковалентная неполярная связь?\n(a)SO3\n(b)H2S\n(c)F2\n(d)CCl4\n\n",
    "Какой из химических элементов не реагирует со щелочью?\n(a)цинк\n(b)фосфор\n(c)бериллий\n(d)магний\n\n",
    "Из предложенных вариантов выберите соединение, которое прореагирует с водородом\n(a)CuO\n(b)CaCl2\n(c)N\n(d)NaOH\n\n",
    "Реакция не протекает между хлором и …\n(a)Cu\n(b)KF\n(c)NaOH\n(d)Si\n\n",
    "С каким из веществ взаимодействует сульфур?\n(a)каустической содой\n(b)бромидом цинка\n(c)аммиаком\n(d)оксидом углерода (IV)\n\n"
]
questions_list8 = [
    Question(var8[0], 'a'),
    Question(var8[1], 'c'),
    Question(var8[2], 'a'),
    Question(var8[3], 'c'),
    Question(var8[4], 'b'),
    Question(var8[5], 'c'),
    Question(var8[6], 'd'),
    Question(var8[7], 'c'),
    Question(var8[8], 'b'),
    Question(var8[9], 'a')
]


var9 = [
    "Какой исторический период в истории России называют «эпохой дворцовых переворотов»?\n(a)1725-1730 гг.\n(b)1682-1725 гг.\n(c)1725-1762 гг.\n(d)Нет правильного ответа\n\n",
    "«Эпоха дворцовых переворотов» подошла к концу с воцарением…?\n(a)Екатерины II\n(b)Петра III\n(c)Ивана Антоновича\n(d)Петра II\n\n",
    "Сколько правителей сменилось на троне со смерти Петра I до конца «эпохи дворцовых переворотов»?\n(a)6\n(b)7\n(c)8\n(d)нет правильного ответа\n\n",
    "Кто не вошел в Верховный тайный совет при Екатерине I?\n(a)А. Д. Меншиков\n(b)Ф.М. Апраксин\n(c)А. И. Остерман\n(d)Б. Х. Миних\n\n",
    "Петр II - … Петра I?\n(a)сын\n(b)внук\n(c)племянник\n(d)нет правильного ответа\n\n",
    "Как умер Петр II?\n(a)От простуды вскоре после того, как переболел оспой\n(b)Убит во время переворота\n(c)В результате несчастного случая на охоте\n(d)Нет правильного ответа\n\n",
    "Чьим фаворитом был Эрнст Иоганн Бирон?\n(a)Екатерины I\n(b)Екатерины II\n(c)Елизаветы\n(d)Нет правильного ответа\n\n",
    "Какой университет основан при Елизавете Петровне?\n(a)Академический университет в Санкт-Петербурге\n(b)Московский университет\n(c)Императорский Казанский Университет\n(d)Императорский Новороссийский Университет в Одессе\n\n",
    "Кто взошел на престол после смерти Елизаветы Петровны?\n(a)Петр III\n(b)Екатерина II\n(c)Павел I\n(d)Нет правильного ответа\n\n",
    "В каком году был убит Петр III?\n(a)1761\n(b)1762\n(c)1768\n(d)Нет правильного ответа\n\n"
]
questions_list9= [
    Question(var9[0], 'c'),
    Question(var9[1], 'a'),
    Question(var9[2], 'b'),
    Question(var9[3], 'd'),
    Question(var9[4], 'b'),
    Question(var9[5], 'a'),
    Question(var9[6], 'd'),
    Question(var9[7], 'b'),
    Question(var9[8], 'a'),
    Question(var9[9], 'b')
]
